algo_design/algo_design.tex
% Created 2019-03-01 Fri 11:59
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Daiwei Chen}
\date{\textit{<2019-02-11 Mon>}}
\title{Algorithm Design\\\medskip
\large Me me big slow}
\hypersetup{
 pdfauthor={Daiwei Chen},
 pdftitle={Algorithm Design},
 pdfkeywords={algorithms design},
 pdfsubject={But it's slow yo},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Divide \& Conquer}
\label{sec:orgb2cbcf6}
\begin{itemize}
\item Break the problem down and solve smaller problems
\item Combine small solutions to form the bigger solution
\item Ask yourself: Is solving problems and combining better?
\begin{itemize}
\item Recursion is not free.
\end{itemize}
\item Do keep in mind: Getting a solution is better than no solution. As long as it's "fast enough".
\end{itemize}

\section{Greedy Solutions}
\label{sec:org6285ef7}
\begin{itemize}
\item Dr. Eloe: "This is the YOLO approach to algorithms, don't look back."
\item Short-term gain over long term benefit.
\item Build the solution one step at a time.
\item At each step, choose the most beneficial choice.
\begin{description}
\item[{Locally optimal}] For that specific step.
\end{description}
\end{itemize}
\subsection{Example - Real life}
\label{sec:orgac26524}
You've got to head to GS after Colden Hall, but it's cold as \textbf{f u c k}. So let's building hop in order to get some warmth. With each step, let's choose the closest building.
\begin{enumerate}
\item Union
\item Admin Building
\item GS
\end{enumerate}
\subsection{Example - Algorithm}
\label{sec:orge378c10}
\begin{description}
\item[{Coin changing}] Given a list of denominations, what is the smallest \# of coins I can dispense for a given amount of change?
\item denoms = [50, 25, 10, 5, 1] \\
A = 70 \\
Start with 50, then 2 dimes.
\end{description}

\begin{verbatim}
# Denominations is always sorted, and you always have a penny
def giveChange (A:int):
    d = 0 # index of our current coin.
    while A > 0:
        c = A // denoms[d] # integer division in python 3
        print(c, "@", denoms[d])
        A -= c*denoms[d]
        d += 1
\end{verbatim}

\begin{itemize}
\item O(n) on average, since you may have to check every single denomination
\item[{A = 18}] gives 10, 5, 3x1s
\item However if you have \\
denoms = [10, 6, 1] and \\
A = 12, you get back 3 coins, the optimal answer is 2
\item[{Greedy Heuristic}] It's an algorithm applied to optimization where you may not get the most optimal answer, but you'll still get an \emph{okay} answer.
\item The question is, is it worth it to spend all this time to get the most optimal solution or something just "good enough". And in certain cases, the optimal solution is very impractical.
\end{itemize}

\section{"Hard" Problem}
\label{sec:org7e9c907}
\subsection{0-1 Napsack Problem}
\label{sec:org1c9f5e9}
You wanna be a very efficient thief. You arrive at a room where there are a lot of items. Each item has a Weight and Value. You have a bag that has infinit volume, but has a max weight capacity. You cannot take part of an item.
\begin{description}
\item[{Brute force}] To calculate all of the possibilities is about \(2^n\) possibilities.
\end{description}
Let's see this:
\begin{center}
\begin{tabular}{rl}
n & Approximate time\\
\hline
10 & 1 MS = .0000001 seconds\\
20 & 1 ms = .001 s\\
30 & 1 second\\
40 & 18.3 min\\
50 & 13 days\\
100 & \(4*10^{13}\) years\\
\end{tabular}
\end{center}
\subsubsection{George Dantzig}
\label{sec:orgf57b97f}
\begin{description}
\item[{Sort by decreasing \(\frac{V_i}{W_i}\)}] \(O(n\log{n})\)
\item[{Grab items that fit into the bag}] \(O(n)\)
\item \(O(n\log{n})+O(n)=O(n\log{n})\)
\item \(O(n\log{n})*O(n)=O(n^2\log{n})\)
\end{description}
\subsection{Filling a room}
\label{sec:org0cf6e65}
You are filling up a room with activities, each activity has a start and end time. How can you fit as many activities into a room as possible?
\begin{enumerate}
\item Sort your activities by finish time.
\item Pick the first and earliest finish time, then pick the next event with the earliest finish time without overlapping.
\item Works well! Greedy algorithm can maximize the event number, but it won't work if you wanted the maximum usage of time then this won't work.
\end{enumerate}

\section{Dynamic Programming}
\label{sec:orgaadd643}
\begin{itemize}
\item Break the problem into subproblems.
\item Solve \uline{all} possible subproblems.
\begin{itemize}
\item Store solutions somewhere for later.
\end{itemize}
\item Use solutions to solve bigger problems.
\item Dynamic Programming is useful for \emph{most} optimization problems that involves on reducing the size of the problem into smaller problems.
\end{itemize}

\subsection{Example: \textbf{Figs}}
\label{sec:org2b36b3c}
Here's a recursive solution
\begin{verbatim}
def fib(n):
    return (n in (1, 0)) ? 1 : fib(n-1) + fib(n-1)
\end{verbatim}
Here's the \textbf{DYNAMIC} approach
\begin{verbatim}
def fib(n):
    fs = [1, 1]
    for i in 2..n:
        fs.append(fs[i-1]+fs[i-2])
    return fs[n]
\end{verbatim}

Basically, you remember your previous solutions. These sequences are generated linearly. Therefor you have a better runtime and Big \(O\).
You can apply this to coin changing, room allocation, and also the 0-1 napsack problem.
\subsection{Back to Coin Changing}
\label{sec:orgbeb6c3d}
\$d = [1, 6, 10]
\(A = 12\)
Here's the table for dynamic programming:
\begin{center}
\begin{tabular}{rrrrrrrrrrrrrr}
 & 0 & 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 & 10 & 11 & 12\\
\hline
0 & 0 & 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 & 10 & 11 & 12\\
1 & 0 & 1 & 2 & 3 & 4 & 5 & 1 & 2 & 3 & 4 & 5 & 6 & 2\\
2 & 0 & 1 & 2 & 3 & 4 & 5 & 1 & 2 & 3 & 4 & 1 & 2 & 2\\
\end{tabular}
\end{center}
C[i][j] = min \# of coins w/ denom of d[0..i] to give back j cents of change. \\
C[2][12] contains the answer. \\
The x symbolizes each smaller problem, each smaller coin change. \\
Each y (the row) represents how many coins we're allowed to use in terms of our denominations. \\
On each row, you calculate the optimal solution using solutions you've used before. For example, on (6, 1), you decide it'll be one 6 cent coin and zero 1 cent coins. \\

Let's look at some \textbf{code}.

\begin{verbatim}
c = [n][A+1]
c[i][0] = 0 # Fills the first collumn with 0s
c[0][j] = j # Fills the first row with its own row index

'''
for all cells within c:

c[i][j] =

c[i-1][j] if j < d[j] # While you cannot fit in another coin, just use the old answer.
min(c[i][j-d[i]] + 1, c[i-1][j]) else # Otherwise check for the min between both answers.
'''
\end{verbatim}

Since you're always looking for the minimum amount. On each cell fill, you look at the potential amount for the current row, but also comparing it to the previous row's answer.
\subsection{Rod Cutting Problem}
\label{sec:org15d0148}
\begin{center}
\begin{tabular}{lrrrrrrrrrr}
\(L_i\) & 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & 9 & 10\\
\hline
\(P_i\) & 1 & 5 & 8 & 9 & 10 & 17 & 17 & 20 & 24 & 30\\
\end{tabular}
\end{center}
You're in the retail business now and you want to cut a rod a certain way. You have a rod of length \(n\) and each length of \(L\) has a price of \(P\). How would you cut the rod in order to \textbf{MAXIMIZE PROFIT} \emph{wow that's a lotta m o n e y} \\
You have \(2^{n-1}\) possibilities to cut the material. This is actually exponential increase. Brute forcing will end your career in CS instantly. \\

Let's make a new table:\\
\(i\) is the length of the rod.\\
\(r_i\) is the maximum revenue for a rod of length \(i\).\\
\(s_i\) is the size of the first cut for a rod of length \(i\).\\
On each iteration, you check if it's more profitable to use a previous calculated optimal solution + however much more. Or you can also check if which combinations of the previous optimal solutions vs newer solutions you create is the better choice.

\begin{center}
\begin{tabular}{rrr}
i & \(r_i\) & \(s_i\)\\
\hline
0 & 0 & 0\\
1 & 1 & 1\\
2 & 5 & 2\\
4 & 10 & 2\\
5 & 13 & 2/3\\
6 & 17 & 6\\
7 & 18 & 1/6/2/3\\
8 & 22 & 2/6\\
9 & 25 & 3/6\\
10 & 30 & 10\\
\end{tabular}
\end{center}

At the end of the table creation. You cut the first time, then use the table to determine where to cut next by "cutting the first time again". In the example of \(n=4\), you start at \(i=4\), and use \(S_4\) to cut by 2 and make 5 dollars, then you're at \(i=2\) and follow \(S_2\) to cut off another 2 and make 5 dollars more. \\
So what's the complexity? On each \(i\), we have to consider \(i\) cases. Thus it is $$\sum_{l=1}^n\sum_{i=1}^l1 = \sum_{l=1}^nl = \frac{n(n+1)}{2} = \Theta(n^2)$$ \\
This big \(\Theta\) isn't technically polynomial. It is \emph{Pseudo-Polynomial}. \\
Let's look at some source code:

\begin{verbatim}
# This will generate the r and s for the solution "lookup" table
def rod_cut(p: list, n: int):
    r = []*(width/n+1)
    s = []*(width/n+1)
    r[0] = 0
    for length in range(1, n+1):
        best = -INF
        for i in range(1, length+1):
            if best < p[i] + r[length-i]:
                best = p[i] + r[length-i]
                s[length] = i
        r[length] = best
    return r, s

# This will actually provide the solution
def printSoln(r: list, s: list, n: int):
    print("Total sale price:", r[n])
    while n > 0:
        print("Cut: ", s[n])
        n -= s[n]
\end{verbatim}

To generate the list, on each operation, you calculate if using a previous example is better or making a new way of cutting it is better. And you save that best for the length \(i\).

\subsection{Longest Common Subsequence}
\label{sec:org35f9f06}
A subsequence is a sequence of elements that appear in the order of the initual sequence. Example: \\
\textbf{NBUD} is a subsequence of \\
S \textbf{N} O W \textbf{B} O \textbf{U} N \textbf{D} \\
The Longest Common Subsequence between two sequences. \\

A, B : Sequences \\
-> 1 Indexed \\
c[i][j]: length of the LCS between A[1:i] to B[1:j] \\
-> \(\Theta\) Indexed \\


Let's look at some code:

\begin{verbatim}
# All of this is 1 indexed
if i==0 or j==0:
    c[i][j]=0

if a[i] != b[i]:
    c[i][j] = max(c[i-1][j], c[i][j-1])
else:
    c[i][j] = 1+c[i-1][j-1]
\end{verbatim}

\subsubsection{Example}
\label{sec:org643b5b0}
A = ['A', 'B', 'C', 'D', 'E', 'F'] \\
B = ['D', 'E', 'F', 'A', 'B', 'C'] \\

\begin{center}
\begin{tabular}{|l|r|rrrrrr|}
c & * & A & B & C & D & E & F\\
\hline
* & 0 & 0 & 0 & 0 & 0 & 0 & 0\\
\hline
D & 0 & 0 & 0 & 0 & 1 & 1 & 1\\
E & 0 & 0 & 0 & 0 & 1 & 2 & 2\\
F & 0 & 0 & 0 & 0 & 1 & 2 & 3\\
A & 0 & 1 & 1 & 1 & 1 & 2 & 3\\
B & 0 & 1 & 2 & 2 & 2 & 2 & 3\\
C & 0 & 1 & 2 & 3 & 3 & 3 & 3\\
\end{tabular}
\end{center}

\begin{verbatim}
A = 'NORTHWEST'.split('')
B = 'BEARCATS'.split('')
\end{verbatim}

\begin{center}
\begin{tabular}{|l|r|rrrrrrrrr|}
c & * & N & O & R & T & H & W & E & S & T\\
\hline
* & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\
\hline
B & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\\
E & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 & 1 & 1\\
A & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 1 & 1 & 1\\
R & 0 & 0 & 0 & 1 & 1 & 1 & 1 & 1 & 1 & 1\\
C & 0 & 0 & 0 & 1 & 1 & 1 & 1 & 1 & 1 & 1\\
A & 0 & 0 & 0 & 1 & 1 & 1 & 1 & 1 & 1 & 1\\
T & 0 & 0 & 0 & 1 & 2 & 2 & 2 & 2 & 2 & 2\\
S & 0 & 0 & 0 & 1 & 2 & 2 & 2 & 2 & 3 & 3\\
\end{tabular}
\end{center}
\end{document}
